#include<iostream>       ////////////如果所有人是线性排列,那我们的工作就是类似冒泡程序
using namespace std;      ///////做的工作:1,2,3,4,5变为5,4,3,2,1 ,耗时n(n-1)/2
int main()                 //////但是出现了环,也就是说1,2,3,4,5变为3,2,1,5,4也可满足条件  
{                          /////// 我们可以把这个环等分成两个部分 ,每个部分看成是线性的,再
    int n,m,a,b;                    //////把它们花的时间加起来.当n是偶数时, 每份人数n/2 ,即
    cin>>n;               /////2*(n/2 )*(n/2 -1)/2;
    while(n--)             ////   当n是奇数时,两份的人数分别是n/2和n/2+1,
    {                   
        cin>>m;
        if(m%2==0) {a=m/2;b=m/2;}
        else {a=m/2;b=a+1;}
        cout<<a*(a-1)/2+b*(b-1)/2<<endl;
    }                   
    system("pause");          
    return 0;                   
}                             
                                      
                                      
                                       
                                      
                                      
                                      
